УчетВУправляющихДляГит1/src/Catalogs/УПЖКХ_ДоговорыДПОИ/УПЖКХ_ДоговорыДПОИ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УПЖКХ_ДоговорыДПОИ</name>
  <attributes>
    <name>НомерДоговора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаключенияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Здание</name>
    <type>
      <types>CatalogRef.КВП_Здания</types>
    </type>
  </attributes>
  <attributes>
    <name>УправляющаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредметДоговора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Арендатор</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧислоНачалаПериодаВнесенияПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МесяцНачалаПериодаВнесенияПлатыТекущий</name>
    <comment>Если ЛОЖЬ, то следующий месяц</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧислоОкончанияПериодаВнесенияПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МесяцОкончаниеПериодаВнесенияПлатыТекущий</name>
    <comment>Если ЛОЖЬ, то следующий месяц</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеРасходованияСредств</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлатаЗаПомещенияМКДМесяц</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорЗаключенНаБезвозмезднойОснове</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИныеУсловияДоговора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УстановленыКонкретныеСрокиОплаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

УчетВУправляющихДляГит1/src/Catalogs/УПЖКХ_ДоговорыДПОИ/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытийСправочника

// Обработчик проверки заполнения справочника.
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если УстановленыКонкретныеСрокиОплаты Тогда
		Если Не МесяцНачалаПериодаВнесенияПлатыТекущий И МесяцОкончаниеПериодаВнесенияПлатыТекущий Тогда
			УПЖКХ_ТиповыеМетодыКлиентСервер.СообщитьОбОшибке("Неверно указан период внесения платы по договору.", Отказ);
		ИначеЕсли МесяцНачалаПериодаВнесенияПлатыТекущий = МесяцОкончаниеПериодаВнесенияПлатыТекущий Тогда
			Если ЧислоНачалаПериодаВнесенияПлаты > ЧислоОкончанияПериодаВнесенияПлаты Тогда
				УПЖКХ_ТиповыеМетодыКлиентСервер.СообщитьОбОшибке("Неверно указан период внесения платы по договору.", Отказ);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

#КонецОбласти

#КонецЕсли
